Repository: jalalmtsk/HezzStar
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Shop
ar: المتجر

source: Collections
ar: المجموعات

source: Home
ar: الرئيسية

source: Events
ar: الفعاليات

source: Settings
ar: الإعدادات

# dataCollectionTitle
source: Data Collection
ar: جمع البيانات

# dataCollectionDesc
source: We only collect information necessary to improve your app experience. This may include your app usage patterns, preferences, and settings.
ar: نحن نجمع فقط المعلومات اللازمة لتحسين تجربتك داخل التطبيق. قد يشمل ذلك أنماط استخدامك للتطبيق، وتفضيلاتك، وإعداداتك.

# dataUsageTitle
source: Data Usage
ar: استخدام البيانات

# dataUsageDesc
source: Your data is used to enhance app functionality, personalize content, and ensure the best performance. We do not sell your data to third parties.
ar: يتم استخدام بياناتك لتحسين وظائف التطبيق، وتخصيص المحتوى، وضمان أفضل أداء ممكن. نحن لا نبيع بياناتك لأي طرف ثالث.

# thirdPartyTitle
source: Third-Party Services
ar: الخدمات التابعة لجهات خارجية

# thirdPartyDesc
source: Some features may use trusted third-party services (like analytics or ads). These services follow their own privacy policies.
ar: قد تستخدم بعض الميزات خدمات خارجية موثوقة (مثل التحليلات أو الإعلانات). وتخضع هذه الخدمات لسياساتها الخاصة بالخصوصية.

# yourRightsTitle
source: Your Rights
ar: حقوقك

# yourRightsDesc
source: You have the right to request data deletion, access stored data, and opt out of optional tracking features.
ar: لديك الحق في طلب حذف بياناتك، والوصول إلى البيانات المخزّنة، والانسحاب من ميزات التتبع الاختيارية.

source: Privacy Policy
ar: سياسة الخصوصية

# creditsTitle
source: Credits
ar: الشكر والتقدير

source: Sfx Music
ar: المؤثرات الصوتية والموسيقى

# ourMissionTitle
source: Our Mission
ar: مهمتنا

# ourMissionContent
source: To bring the excitement of traditional Moroccan card games to mobile platforms with engaging visuals and gamified experiences.
ar: هدفنا هو نقل متعة الألعاب الورقية المغربية التقليدية إلى المنصات الرقمية بتجربة تفاعلية ورسوم جذابة.

# futurePlansTitle
source: Future Plans
ar: خططنا المستقبلية

# futurePlansContent
source: We plan to add multiplayer tournaments, new cards and themes, and interactive leaderboards to enhance the gaming experience.
ar: نخطط لإضافة بطولات جماعية، وبطاقات ومواضيع جديدة، ولوحات صدارة تفاعلية لتعزيز تجربة اللعب.

# followUs
source: Follow us on Social Media
ar: تابعنا على وسائل التواصل الاجتماعي

source: Contact
ar: اتصل بنا

source: Close
ar: إغلاق

source: Tap anywhere to collect
ar: اضغط في أي مكان لجمع

# adFailedToLoad
source: Ad failed to load. Try again later
ar: فشل تحميل الإعلان. حاول لاحقًا

source: SHOP Not Available
ar: المتجر غير متوفر

source: Coming soon...
ar: قريبًا...

# notConnectedToInternet
source: You are not connected to the internet
ar: أنت غير متصل بالإنترنت

# playWithoutInternet
source: Play without internet. Great for practicing!
ar: العب بدون إنترنت. رائع للتدريب!

source: Challenge
ar: تحدي

source: Players in this mode
ar: اللاعبون في هذا الوضع

source: Level
ar: المستوى

source: Total Earnings
ar: إجمالي الأرباح

source: Gold
ar: ذهب

source: Wins 3 Players
ar: انتصارات 3 لاعبين

source: Wins 4 Players
ar: انتصارات 4 لاعبين

source: Wins 5 Players
ar: انتصارات 5 لاعبين

source: Skins
ar: الأشكال

source: Avatars
ar: الأفاتار

source: Tables
ar: الطاولات

source: Edit Username
ar: تعديل اسم المستخدم

source: Enter new username
ar: أدخل اسم مستخدم جديد

source: Save
ar: حفظ

source: Wins 1v1
ar: انتصارات 1 ضد 1

source: PLAYER
ar: اللاعب

source: You can spin again in
ar: يمكنك الدوران مرة أخرى بعد

source: Ready
ar: جاهز

# cooldownReset
source: Cooldown reset! You can spin now.
ar: تم إعادة ضبط المهلة! يمكنك الدوران الآن.

source: Spin
ar: دوران

source: Spin Wheel
ar: تدوير العجلة

source: Timer Ready
ar: المؤقت جاهز

source: Spin Again
ar: الدوران مرة أخرى

source: Card Skins
ar: تصاميم البطاقات

source: Table Skins
ar: تصاميم الطاولات

source: Not enough
ar: غير كافٍ

source: Selected
ar: تم الاختيار

source: Unlocked
ar: تم الفتح

source: Table Skin Unlocked!
ar: تم فتح تصميم الطاولة!

source: Awesome
ar: رائع

source: Unlock Table Skin
ar: فتح تصميم الطاولة

source: Unlock Card
ar: فتح البطاقة

source: Avatar Unlocked
ar: تم فتح الصورة الرمزية

source: Unlock Avatar
ar: فتح الصورة الرمزية

source: Unlock
ar: فتح

source: Unlock for
ar: فتح مقابل

source: Card Unlocked
ar: تم فتح البطاقة

source: Mythical
ar: أسطوري

source: Fantasy
ar: خيالي

source: Avatar Skins
ar: تصاميم الصور الرمزية

source: CardMaster
ar: سيد البطاقات

source: Elements
ar: العناصر

source: Cards
ar: بطاقات

source: Choose a Suit
ar: اختر نوع البطاقة

# confirmLeaveGame
source: Do you really want to leave the game
ar: هل تريد حقًا مغادرة اللعبة

# returnToLauncher
source: and return to the launcher?
ar: والعودة إلى الشاشة الرئيسية؟

source: Exit
ar: خروج

source: Instructions
ar: التعليمات

# gameSetupAndControls
source: Game Setup & Controls
ar: إعداد اللعبة والتحكم

# chooseMode
source: Choose mode: PlayToWin or Elimination
ar: اختر الوضع: اللعب للفوز أو الإقصاء

# suitsAndRanks
source: • 4 Suits / 10 Ranks • Choose The Same Suit Or Same Rank
ar: • 4 ألوان / 10 درجات • اختر نفس اللون أو نفس الدرجة

# specialCardsAndEffects
source: Special Cards & Effects
ar: البطاقات الخاصة والتأثيرات

# skipsNextPlayerTurn
source: Skips the next player's turn.
ar: يتخطى دور اللاعب التالي.

# skipCard
source: 1: Skip
ar: 1: تخطي

# drawTwoCard
source: 2: Draw +2
ar: 2: سحب +2

# drawTwoEffect
source: Adds +2 to pending draw. • Can chain with another 2.
ar: يضيف +2 للسحب المعلق. • يمكن ربطه ببطاقة 2 أخرى.

# changeSuitCard
source: 7: Change Suit
ar: 7: تغيير اللون

# changeSuitEffect
source: • Allows player to change the suit.
ar: • يسمح للاعب بتغيير اللون.

source: Gameplay Tips
ar: نصائح اللعب

source: Tip #1
ar: نصيحة #1

# tip1Description
source: Aim to empty your hand first in PlayToWin mode.
ar: حاول تفريغ يدك أولاً في وضع اللعب للفوز.

source: Tip #2
ar: نصيحة #2

source: Tip #3
ar: نصيحة #3

# tip3Description
source: Watch for special combos (1,2,7) to control the flow.
ar: انتبه للتركيبات الخاصة (1،2،7) للتحكم في سير اللعبة.

source: Winning Gold
ar: الذهب المكتسب

source: Players
ar: اللاعبون

source: On
ar: تشغيل

source: Off
ar: إيقاف

source: Add
ar: إضافة

source: Cancel
ar: إلغاء

source: Warriors
ar: المحاربون

# notEnoughGoldForAnimation
source: Not enough gold to use this animation
ar: لا يوجد ما يكفي من الذهب لاستخدام هذا التأثير

source: Bot
ar: بوت

source: Qualified
ar: تأهل

source: ELIMINATED
ar: تم الإقصاء

source: Prizes
ar: الجوائز

source: Reward Distribution
ar: توزيع المكافآت

source: Total Pool
ar: المجموعة الكاملة

source: Bet
ar: رهان

source: Loss
ar: خسارة

source: Disconnected
ar: تم قطع الاتصال

source: Redirecting in
ar: إعادة التوجيه خلال

source: Searching for players...
ar: جارٍ البحث عن لاعبين...

source: ⚡ Match Found
ar: ⚡ تم العثور على مباراة

source: No Connection
ar: لا يوجد اتصال

# earnOrBuyGold
source: Earn or buy more gold to place this bet.
ar: اكسب أو اشترِ المزيد من الذهب لوضع هذا الرهان.

source: Not Enough Gold!
ar: ذهب غير كافٍ!

source: Start Match
ar: ابدأ المباراة

source: Start Elimination
ar: ابدأ الإقصاء

source: Mode
ar: الوضع

source: Play
ar: اللعب

source: Elim
ar: إقصاء

source: Lobby
ar: الردهة

source: Empty
ar: فارغ

source: Draw Pile
ar: رصيد السحب

source: Top Card
ar: أعلى بطاقة

source: OUT
ar: خارج

source: QUAL
ar: تأهل

source: TURN
ar: دور

source: Leave Game
ar: مغادرة اللعبة

source: Spectating
ar: مشاهدة

source: You have been eliminated
ar: تم إقصاؤك

source: Press "Leave Game" to exit
ar: اضغط على "مغادرة اللعبة" للخروج

# spectatingPressJoinGame
source: You are spectating. Press "Join Game" to play again.
ar: أنت تشاهد. اضغط على "الانضمام للعبة" للعب مرة أخرى.

source: Preparing next round
ar: تحضير الجولة التالية

source: Complete
ar: مكتمل

source: Round
ar: جولة

source: Please wait
ar: يرجى الانتظار

source: Elimination
ar: الإقصاء

source: Play To Win
ar: العب للفوز

source: Offline Lobby
ar: الردهة دون اتصال

source: Quit Game
ar: إنهاء اللعبة

# confirmLeaveMatch
source: Are you sure you want to leave the match?
ar: هل أنت متأكد أنك تريد مغادرة المباراة؟

source: Wins
ar: انتصارات

# drewAndSkipped
source: Drew & Skipped
ar: سحب وتخطى الدور

source: Drew
ar: سحب بطاقة

source: Skip
ar: تخطى الدور

source: Card not playable
ar: لا يمكن لعب هذه البطاقة

source: Rewards shared by score ratio
ar: تم تقاسم المكافآت حسب نسبة النقاط

source: Final Scoreboard
ar: النتائج النهائية

source: Congratulations
ar: تهانينا

source: Back to Lobby
ar: العودة إلى الردهة

source: Playing
ar: جارٍ اللعب

source: Version
ar: الإصدار

source: Reset
ar: إعادة تعيين

source: Emoji Animations
ar: حركات الرموز التعبيرية

source: Button Sounds
ar: أصوات الأزرار

source: Sound Effects
ar: المؤثرات الصوتية

source: Background Music
ar: الموسيقى الخلفية

source: Rate App
ar: تقييم التطبيق

source: Credits
ar: حقوق التأليف

source: Contact Support
ar: اتصل بالدعم

source: About App
ar: حول التطبيق

# aboutAndSupport
source: About & Support
ar: حول ودعم

source: Game Instructions
ar: تعليمات اللعبة

source: Select Language
ar: اختر اللغة

source: Language
ar: اللغة

source: General
ar: عام
